// Румен иска да пребоядиса хола и за целта е наел майстори. Напишете програма, която изчислява разходите за ремонта, предвид следните цени:
// · Предпазен найлон - 1.50 лв. за кв. метър
// · Боя - 14.50 лв. за литър
// · Разредител за боя - 5.00 лв. за литър
// За всеки случай, към необходимите материали, Румен иска да добави още 10% от количеството боя и 2 кв.м. найлон, разбира се и 0.40 лв. за торбички. 
// Сумата, която се заплаща на майсторите за 1 час работа, е равна на 30% от сбора на всички разходи за материали.
// Вход -Входът се чете от конзолата и съдържа точно 4 реда:
// 1. Необходимо количество найлон (в кв.м.) - цяло число в интервала [1... 100]
// 2. Необходимо количество боя (в литри) - цяло число в интервала [1…100]
// 3. Количество разредител (в литри) - цяло число в интервала [1…30]
// 4. Часовете, за които майсторите ще свършат работата - цяло число в интервала [1…9]
// Изход - Да се отпечата на конзолата един ред: · "{сумата на всички разходи}"

// Вход - ["10","11","4","8"]
// Изход - 727.09
// Обяснение - 
// Сума за найлон: (10 + 2) * 1.50 = 18 лв. 
// Сума за боя: (11 + 10%) * 14.50 = 175.45 лв. 
// Сума за разредител: 4 * 5.00 = 20.00 лв. 
// Сума за торбички: 0.40 лв. 
// Обща сума за материали: 18 + 175.45 + 20.00 + 0.40 = 213.85 лв. 
// Сума за майстори: (213.85 * 30%) * 8 = 513.24 лв.

function repainting(input){
    let nylon = Number(input[0]);
    let paint = Number(input[1]);
    let thinner = Number(input[2]);
    let hours = Number(input[3]);
    
    let nylonFinalSum = (nylon + 2) * 1.50;
    let paintFinalSum = (paint * 1.1) * 14.50;
    let thinnerFinalSum = thinner * 5;

    let bagPrice = 0.40;

    let materialsFinalSum = nylonFinalSum + paintFinalSum + thinnerFinalSum + bagPrice;
    
    let finalSum = (materialsFinalSum * 0.3) * hours;
    let finalSumWithMaterials = finalSum + materialsFinalSum;

    console.log(finalSumWithMaterials);
}
repainting(["10","11","4","8"]);