// Напишете програма, която пресмята нужните разходи за закупуването на храна за кучета и котки. Храната се пазарува от зоомагазин, 
// като една опаковка храна за кучета е на цена 2.50 лв, а опаковка храна за котки струва 4 лв.

// Вход :  От конзолата се четат 2 реда:
// 1. Броят на опаковките храна за кучета – цяло число в интервала [0… 100]
// 2. Броят на опаковките храна за котки – цяло число в интервала [0… 100]

// Изход :  На конзолата се отпечатва: "{крайната сума} lv."

function petshop(input){
    let dogfood = Number(2.50);
    let catfood = Number(4);
    
    let dogfoodPrice = dogfood * input[0];
    let catfoodPrice = catfood * input[1];

    let finalPrice = dogfoodPrice + catfoodPrice

    console.log(`${finalPrice} lv.`);

}
petshop(["5","4"]);